## Pandas

In [2]:
import pandas as pd
import numpy as np

In [11]:
d = {
    'name': ['a', 'b', 'c', 'd', 'e', 'f'],
    'marks': [45, 67, 89, 90, 78, 90],
    'age': [22, 23, 22, 21, 23, 24]
}
# string is called object in pandas
df = pd.DataFrame(d)
print(df)
arr = np.array(df)
print(arr)

  name  marks  age
0    a     45   22
1    b     67   23
2    c     89   22
3    d     90   21
4    e     78   23
5    f     90   24
[['a' 45 22]
 ['b' 67 23]
 ['c' 89 22]
 ['d' 90 21]
 ['e' 78 23]
 ['f' 90 24]]

In [13]:
# print(df.info())
df['marks'] = df['marks'].astype('int8')
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   marks   6 non-null      int8
 2   age     6 non-null      int64
dtypes: int64(1), int8(1), object(1)
memory usage: 230.0+ bytes
None

In [16]:
print(df.columns)
print(df.index)

Index(['name', 'marks', 'age'], dtype='object')
RangeIndex(start=0, stop=6, step=1)

# 29/09/2022

In [1]:
import pandas as pd
import numpy as np

d = {
    'name': ['a', 'b', 'c', 'd'],
    'marks': [45, 67, 89, 90],
    'age': [22, 23, 22, 23]
}

df = pd.DataFrame(d)

In [2]:
print(df)

  name  marks  age
0    a     45   22
1    b     67   23
2    c     89   22
3    d     90   23

In [3]:
df.to_excel(r'./abc.xlsx')

In [1]:
from pandas import read_csv


df = read_csv(r'./Data.csv')
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Place      10 non-null     object
 1   age        9 non-null      float64
 2   Income     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes
None

In [8]:
a = df['Place']
print(type(a))
print(df.loc[0])

<class 'pandas.core.series.Series'>
Place         France
age             44.0
Income       72000.0
Purchased         No
Name: 0, dtype: object

series has one column, dataframe has multiple columns

In [6]:
a = df[['Place', 'age']]
print(type(a))
print(a)

<class 'pandas.core.frame.DataFrame'>
     Place   age
0   France  44.0
1    Spain  27.0
2  Germany  30.0
3    Spain  38.0
4  Germany  40.0
5   France  35.0
6    Spain   NaN
7   France  48.0
8  Germany  50.0
9   France  37.0

In [7]:
# df to mysql

In [8]:
print(df.head(5))
print(df.tail(5))

     Place   age   Income Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
     Place   age   Income Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [9]:
print(df[["Place", "age"]].head(5))

     Place   age
0   France  44.0
1    Spain  27.0
2  Germany  30.0
3    Spain  38.0
4  Germany  40.0

In [10]:
print(df['Income'].min())
print(df['Income'].max())
print(df['Income'].mean())
print(df['Income'].median())
print(df['Income'].std())
print(df['Income'].var)
print(df['Income'].sum())

48000.0
83000.0
63777.77777777778
61000.0
12265.579661982732
<bound method NDFrame._add_numeric_operations.<locals>.var of 0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Income, dtype: float64>
574000.0

In [11]:
print(df['Income'])
print(df['Income'][0])

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Income, dtype: float64
72000.0

In [12]:
# df['Income'][4]=df['Income'].mean()
# print(df)

In [13]:
print(df)

     Place   age   Income Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [14]:
a = df['Income'].isna()
print(a)

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
Name: Income, dtype: bool

In [15]:
print(a)
print(np.array(a))
arr = np.array(a)

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
Name: Income, dtype: bool
[False False False False  True False False False False False]

In [16]:
tem = np.where(arr)[0]
# print(tem)
print(df['Income'][tem])
# remove nan

4   NaN
Name: Income, dtype: float64

In [17]:
# df[['Income','age']] = df[['Income','age']].fillna()

In [18]:
print(df)

     Place   age   Income Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [1]:
import mysql.connector

conn = mysql.connector.connect(user='root',
                               host='localhost',
                               port=3306,
                               password='')

cur = conn.cursor()

cur.execute('use pandasdata')
# try:
# cur.execute('create table country(place varchar(20), age varchar(20), Income varchar(20), Purchased varchar(10));')
# except: pass

InterfaceError: 2003: Can't connect to MySQL server on 'localhost:3306' (111 Connection refused)

In [40]:
# df = pd.ExcelFile('./abc.xlsx')
# df_sheet = df.parse(sheet_name='Sheet1')
# print(df_sheet)
# df_sheet.to_sql('Sheet1', conn, if_exists='append')
df = pd.read_excel('./abc.xlsx')
df.to_sql('country', con=conn)

/home/darklord/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

# 30/09/2022

In [1]:
import numpy as np
import pandas as pd

In [17]:
df = pd.read_csv('./Data.csv')
print(df)

     Place   age   Income Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
# sort
df = pd.read_csv('./Data.csv')

df = df.sort_values('age')
print(df)

     Place   age   Income Purchased
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
5   France  35.0  58000.0       Yes
9   France  37.0  67000.0       Yes
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
0   France  44.0  72000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
6    Spain   NaN  52000.0        No

In [13]:
df = pd.read_csv('./Data.csv')

df = df.set_index('age')
print(df)
print(df.info)

        Place   Income Purchased
age
44.0   France  72000.0        No
27.0    Spain  48000.0       Yes
30.0  Germany  54000.0        No
38.0    Spain  61000.0        No
40.0  Germany      NaN       Yes
35.0   France  58000.0       Yes
NaN     Spain  52000.0        No
48.0   France  79000.0       Yes
50.0  Germany  83000.0        No
37.0   France  67000.0       Yes
<bound method DataFrame.info of         Place   Income Purchased
age
44.0   France  72000.0        No
27.0    Spain  48000.0       Yes
30.0  Germany  54000.0        No
38.0    Spain  61000.0        No
40.0  Germany      NaN       Yes
35.0   France  58000.0       Yes
NaN     Spain  52000.0        No
48.0   France  79000.0       Yes
50.0  Germany  83000.0        No
37.0   France  67000.0       Yes>

In [14]:
#  index a1 a2 a3 .....

In [20]:
df = pd.read_csv('./Data.csv')

df = df.set_index('age')
print(df)
df = df.reset_index()
print(df)

        Place   Income Purchased
age
44.0   France  72000.0        No
27.0    Spain  48000.0       Yes
30.0  Germany  54000.0        No
38.0    Spain  61000.0        No
40.0  Germany      NaN       Yes
35.0   France  58000.0       Yes
NaN     Spain  52000.0        No
48.0   France  79000.0       Yes
50.0  Germany  83000.0        No
37.0   France  67000.0       Yes
    age    Place   Income Purchased
0  44.0   France  72000.0        No
1  27.0    Spain  48000.0       Yes
2  30.0  Germany  54000.0        No
3  38.0    Spain  61000.0        No
4  40.0  Germany      NaN       Yes
5  35.0   France  58000.0       Yes
6   NaN    Spain  52000.0        No
7  48.0   France  79000.0       Yes
8  50.0  Germany  83000.0        No
9  37.0   France  67000.0       Yes

In [21]:
df = pd.read_csv('./Data.csv')
df = df.set_index('age')
print(df)
df = df.reset_index(drop=True)
print(df)

        Place   Income Purchased
age
44.0   France  72000.0        No
27.0    Spain  48000.0       Yes
30.0  Germany  54000.0        No
38.0    Spain  61000.0        No
40.0  Germany      NaN       Yes
35.0   France  58000.0       Yes
NaN     Spain  52000.0        No
48.0   France  79000.0       Yes
50.0  Germany  83000.0        No
37.0   France  67000.0       Yes
     Place   Income Purchased
0   France  72000.0        No
1    Spain  48000.0       Yes
2  Germany  54000.0        No
3    Spain  61000.0        No
4  Germany      NaN       Yes
5   France  58000.0       Yes
6    Spain  52000.0        No
7   France  79000.0       Yes
8  Germany  83000.0        No
9   France  67000.0       Yes

In [22]:
df = pd.read_csv('./Data.csv')
df = df.set_index('age', drop=False)
print(df)
df = df.reset_index()
print(df)

        Place   age   Income Purchased
age
44.0   France  44.0  72000.0        No
27.0    Spain  27.0  48000.0       Yes
30.0  Germany  30.0  54000.0        No
38.0    Spain  38.0  61000.0        No
40.0  Germany  40.0      NaN       Yes
35.0   France  35.0  58000.0       Yes
NaN     Spain   NaN  52000.0        No
48.0   France  48.0  79000.0       Yes
50.0  Germany  50.0  83000.0        No
37.0   France  37.0  67000.0       Yes

ValueError: cannot insert age, already exists

In [48]:
df = pd.read_csv('./Data.csv')
print(df.isna().sum())

Place        0
age          1
Income       1
Purchased    0
dtype: int64

In [27]:
df = df.dropna()
print(df.isna().sum().sum())

0

In [28]:
df = pd.read_csv('./Data.csv')
age=df['age'][0:5]
print(age)

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
Name: age, dtype: float64

In [31]:
age = df.loc[0]
print(age)
age = df.loc[2:7]
print(age)
age = df.loc[2:4:6]
print(age)

Place         France
age             44.0
Income       72000.0
Purchased         No
Name: 0, dtype: object
     Place   age   Income Purchased
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
     Place   age   Income Purchased
2  Germany  30.0  54000.0        No

In [32]:
print(df.loc[:])

     Place   age   Income Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [33]:
print(df.loc[:,'Place'])

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Place, dtype: object

In [34]:
print(df.loc[:,'Place':'Income'])

     Place   age   Income
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [35]:
print(df.loc[1:8,'Place':'Income'])

     Place   age   Income
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0

In [36]:
print(df.loc[[0,4,7,8],'Place':'Income'])

     Place   age   Income
0   France  44.0  72000.0
4  Germany  40.0      NaN
7   France  48.0  79000.0
8  Germany  50.0  83000.0

In [37]:
df=pd.read_csv('./Data.csv')
temp=df['age']>=40
print(temp)

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7     True
8     True
9    False
Name: age, dtype: bool

In [38]:
a=df.loc[temp]
print(a)

     Place   age   Income Purchased
0   France  44.0  72000.0        No
4  Germany  40.0      NaN       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No

In [39]:
temp=df['Income']>=60000
print(df.loc[temp,'Place'])

0     France
3      Spain
7     France
8    Germany
9     France
Name: Place, dtype: object

In [44]:
temp=df['age']>40
print(df.loc[temp,'Income'])
df.loc[temp,'Income']=df.loc[temp,'Income']/2

0    72000.0
7    79000.0
8    83000.0
Name: Income, dtype: float64

In [45]:
print(df)

     Place   age   Income Purchased
0   France  44.0  36000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  39500.0       Yes
8  Germany  50.0  41500.0        No
9   France  37.0  67000.0       Yes

In [50]:
df=(df['age']>30 & (df['Purchased']=='Yes'))
print(df)

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7     True
8     True
9     True
dtype: bool

# 03/10/2022

In [1]:
import pandas as pd
import numpy as np

df=pd.read_csv('./insurance.csv')

In [2]:
print(df.isna().sum())
print(df.columns)

age         0
gender      0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64
Index(['age', 'gender', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [3]:
# persons belonging to south-west (count)
series=(df['region'].str.contains('southwest')) &(df['gender'].str.startswith('male'))
df[series]

      age gender   bmi  children smoker     region     charges
12     23   male  34.4         0     no  southwest   1826.8430
15     19   male  24.6         1     no  southwest   1837.2370
18     56   male  40.3         0     no  southwest  10602.3850
19     30   male  35.3         0    yes  southwest  36837.4670
29     31   male  36.3         2    yes  southwest  38711.0000
...   ...    ...   ...       ...    ...        ...         ...
1295   20   male  22.0         1     no  southwest   1964.7800
1303   43   male  27.8         0    yes  southwest  37829.7242
1309   41   male  32.2         2     no  southwest   6875.9610
1312   34   male  42.9         1     no  southwest   4536.2590
1329   52   male  38.6         2     no  southwest  10325.2060

[163 rows x 7 columns]

In [4]:
print(df.loc[:,'region'].value_counts())
print(df.loc[:,'region'].value_counts().index)

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64
Index(['southeast', 'southwest', 'northwest', 'northeast'], dtype='object')

In [5]:
series=(df['gender']=='female') & (df['smoker']=='yes') & (df['region']=='southwest') & (df['children']>=2)
series

0       False
1       False
2       False
3       False
4       False
        ...
1333    False
1334    False
1335    False
1336    False
1337    False
Length: 1338, dtype: bool

In [6]:
print(df.loc[series])

      age  gender   bmi  children smoker     region    charges
84     37  female  34.8         2    yes  southwest  39836.519
94     64  female  31.3         2    yes  southwest  47291.055
251    63  female  32.2         2    yes  southwest  47305.305
417    36  female  22.6         2    yes  southwest  18608.262
860    37  female  47.6         2    yes  southwest  46113.511
1085   39  female  18.3         5    yes  southwest  19023.260
1171   43  female  26.7         2    yes  southwest  22478.600
1313   19  female  34.7         2    yes  southwest  36397.576

In [1]:
import pandas as pd
df = pd.read_csv('./insurance.csv')
af= (df['gender'] == 'female') & (df['region'] == 'southwest')
# af=df.loc[af]
# print(af)
all_female=df[af]
af_count=df.loc[af,'gender'].value_counts()[0]
print(af_count)
# print(all_female)

162

In [2]:
smoker_female=all_female['smoker']=='yes'
smoker_female_count=all_female.loc[smoker_female,'gender'].value_counts()[0]
print((int(smoker_female_count)/int(af_count))*100)

12.962962962962962

In [5]:
alm=(df['gender'].str.startswith( 'male')) & (df['region'] == 'southwest')

al_male_count=df.loc[alm,'gender'].value_counts()[0]
print(al_male_count)
al_male=df.loc[alm]

163

In [11]:
male_smoker=al_male['smoker']=='yes'

male_smoker_count=al_male.loc[male_smoker,'gender'].value_counts()[0]
percen_male_smoker=(male_smoker_count/al_male_count)*100
print(percen_male_smoker)

22.699386503067483

In [ ]:
df1=pd.read_csv('Data.csv')
print(df1.columns)

Index(['Place', 'age', 'Income', 'Purchased'], dtype='object')

In [ ]:
df1.loc[:,'Income']=df1.loc[:,'Income'].fillna(value=0)
print(df1)

     Place   age   Income Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      0.0       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [ ]:
df1.loc[:,'Income']=df1.loc[:,'Income'].fillna(method='bfill')
print(df1)
# df1.loc[:,'Income']=df1.loc[:,'Income'].fillna(method='bfill')

     Place   age   Income Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  58000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

region nw, female ==0 ==1 charges mean
region nw, female, child >-=2 charges mean
which is more

nw male yes smoker child >2 charges mean 
nw male yes smoker child <=1 charges mean 
which is more

In [25]:

nwf = (df['gender'] == 'female') & (df['region'] == 'northwest')
# print(df.loc[nwf])
nwf_count = df.loc[nwf, 'gender'].value_counts()[0]
nwf1 = (df['gender'] == 'female') & (df['region'] == 'northwest')& (df['children']<=1)
print(df.loc[nwf1,['charges']].mean())
# print(df.loc[nwf1])
nwf2 = (df['gender'] == 'female') & (df['region'] == 'northwest')& (df['children']>=2)
print(df.loc[nwf2,'charges'].mean())
# print(df.loc[nwf2])

charges    12123.438375
dtype: float64
13114.198571355933

In [26]:
nwm1 = (df['gender'].str.startswith('male')) & (df['region'] ==
                                                'northwest') & (df['children'] <= 1) & (df['smoker'] == 'yes')
print(df.loc[nwm1, ['charges']].mean())
nwm2 = (df['gender'].str.startswith('male')) & (df['region'] ==
                                                'northwest') & (df['children'] >= 2) & (df['smoker'] == 'yes')
print(df.loc[nwf2, 'charges'].mean())

charges    24897.0677
dtype: float64
13114.198571355933

# 04/10/2022